import fetch from 'node-fetch'
let handler = async (m, { conn }) => {
  let caption = `
[𝑨𝑻𝑹𝑬𝑼S-𝑴𝑫-𝑽𝟏] 🤖
HEY ${conn.getName(m.sender)}
🅷🅴🆈 🆃🅷🅴🆁🅴! 🅸🆃🆂 🆁🅴🅻🅻🆈 🅽🅸🅲🅴 🆃🅾 🅼🅴🅴🆃 🆈🅾🆄.
[ I̳N̳F̳O̳ ̳R̳O̳B̳O̳T̳ ]✨
🫧𝑾𝒆𝒍𝒄𝒐𝒎𝒆 𝒕𝒐 𝒙𝑨𝑻𝑹𝑬𝑼𝑺𝒙! 𝑴𝒚 𝒏𝒂𝒎𝒆 𝒊𝒔 (𝑨𝒍𝒊 𝑯𝒂𝒊𝒅𝒆𝒓),𝒕𝒉𝒆 𝒄𝒓𝒆𝒂𝒕𝒐𝒓 𝒐𝒇 𝒕𝒉𝒊𝒔 𝑾𝒉𝒂𝒕𝒔𝑨𝒑𝒑 𝒃𝒐𝒕. 𝑳𝒆𝒕 𝒎𝒆 𝒌𝒏𝒐𝒘 𝒉𝒐𝒘 𝑰 𝒄𝒂𝒏 𝒂𝒔𝒔𝒊𝒔𝒕 𝒚𝒐𝒖 𝒕𝒐𝒅𝒂𝒚."
𝚰'ꭑ 𝗒ⱺυ𝗋 ρ𝖾𝗋𝗌ⱺ𐓣αᥣ 𝐖ɦα𝗍𝗌𝐀ρρ α𝗌𝗌𝗂𝗌𝗍α𐓣𝗍.🪀
𝐇𝐄𝐋𝐏:
🎤𝘠𝘰𝘶 𝘤𝘢𝘯 𝘤𝘰𝘯𝘵𝘢𝘤𝘵 𝘮𝘦 𝘥𝘪𝘳𝘦𝘤𝘵𝘭𝘺 𝘢𝘵 (͟+͟9͟2͟ ͟3͟1͟4͟2͟9͟1͟3͟2͟0͟0͟)͟ 𝘪𝘧 𝘺𝘰𝘶 𝘩𝘢𝘷𝘦 𝘢𝘯𝘺 𝘲𝘶𝘦𝘴𝘵𝘪𝘰𝘯𝘴 𝘰𝘳 𝘧𝘦𝘦𝘥𝘣𝘢𝘤𝘬.
𝗝𝗨𝗦𝗧 𝗖𝗢𝗠𝗠𝗔𝗡𝗗 𝗧𝗛𝗘 𝗕𝗢𝗧 𝗧𝗛𝗘𝗡 𝗦𝗘𝗘 𝗢𝗞｡ 𝗔𝗡𝗬 𝗜𝗦𝗦𝗨𝗘 𝗖𝗢𝗡𝗧𝗔𝗖𝗧 𝗧𝗛𝗘 𝗕𝗢𝗧 𝗢𝗪𝗡𝗘𝗥｡🔧
🫴The fllowing guides:
       [ G̷U̷I̷D̷N̷E̷S̷S̷ ]
(These some guides to use robot)👇🏽 
For Example: 👉🏼.𝐦𝐞𝐧𝐮 𝐋𝐢𝐬𝐭 𝐨𝐟 𝐫𝐨𝐛𝐨𝐭'𝐬 𝐦𝐞𝐧𝐮
👉🏼.𝐭𝐢𝐤𝐭𝐨𝐤 𝐞𝐧𝐣𝐨𝐲 𝐲𝐨𝐮𝐫 𝐯𝐢𝐝𝐞𝐨 𝐰𝐢𝐭𝐡𝐨𝐮𝐭 𝐰𝐚𝐭𝐞𝐫𝐦𝐚𝐫𝐤.
👉🏼.𝐩𝐥𝐚𝐲 𝐘𝐨𝐮𝐭𝐮𝐛𝐞 𝐯𝐢𝐝𝐞𝐨/𝐚𝐮𝐝𝐢𝐨
👉🏼.𝐠𝐢𝐦𝐚𝐠𝐞 𝐆𝐨𝐨𝐠𝐥𝐞 𝐢𝐦𝐚𝐠𝐞 𝐝𝐨𝐰𝐧𝐥𝐨𝐚𝐝𝐞𝐫
👉🏼.𝐚𝐧𝐢𝐦𝐞  𝐲𝐨𝐮𝐫 𝐩𝐢𝐜 𝐭𝐫𝐚𝐧𝐟𝐨𝐫𝐦 𝐢𝐧𝐭𝐨 𝐚𝐧𝐢𝐦𝐞
(𝐔𝐬𝐞 𝐭𝐡𝐞 𝐚𝐯𝐚𝐢𝐥𝐚𝐛𝐥𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬 𝐭𝐨 𝐞𝐱𝐩𝐥𝐨𝐫𝐞 𝐭𝐡𝐞 𝐟𝐞𝐚𝐭𝐮𝐫𝐞𝐬 𝐨𝐟 𝐭𝐡𝐢𝐬 𝐛𝐨𝐭.)
⚠𝗜𝗙 𝗨 𝗦𝗘𝗘 𝗧𝗛𝗔𝗧 𝗧𝗛𝗘𝗥𝗘 𝗜𝗦 𝗔𝗡 𝗘𝗥𝗥𝗘𝗢𝗥 𝗠𝗘𝗦𝗦𝗔𝗚𝗘 𝗝𝗨𝗦𝗧 𝗗𝗜𝗦𝗖𝗨𝗦𝗦 𝗧𝗢 𝗠𝗘｡
♦𝙁𝙚𝙚𝙡 𝙛𝙧𝙚𝙚 𝙩𝙤 𝙘𝙤𝙣𝙩𝙖𝙘𝙩 𝙢𝙚 𝙖𝙩 +𝟵𝟮 𝟯𝟭𝟰𝟮𝟵𝟭𝟯𝟮𝟬𝟬 𝙛𝙤𝙧 𝙖𝙣𝙮 𝙦𝙪𝙚𝙧𝙞𝙚𝙨 𝙤𝙧 𝙛𝙚𝙚𝙙𝙗𝙖𝙘𝙠｡"
*𝑻𝒉𝒂𝒏𝒌𝒔 𝑭𝒐𝒓 𝑼𝒔𝒊𝒏𝒈 𝑨𝒕𝒓𝒆𝒖𝒔-𝑴𝑫-𝒗𝟏🤍 
`.trim()
  m.reply(caption)
}
handler.help = ['alive']
handler.tags = ['bot check']
handler.command = /^(alive|Hi)$/i


export default handler